-- phpMyAdmin SQL Dump
-- version 4.7.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Май 08 2025 г., 23:23
-- Версия сервера: 10.1.36-MariaDB
-- Версия PHP: 7.2.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `wincc`
--

-- --------------------------------------------------------

--
-- Структура таблицы `data`
--

CREATE TABLE `data` (
  `ID` int(10) NOT NULL,
  `Name` varchar(50) NOT NULL,
  `Parameter` decimal(10,2) NOT NULL,
  `Dates` varchar(17) NOT NULL DEFAULT '0000-00-00',
  `Times` varchar(17) NOT NULL DEFAULT '00:00:00'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `data`
--

INSERT INTO `data` (`ID`, `Name`, `Parameter`, `Dates`, `Times`) VALUES
(2779, 'Температура охолодження вина', '14.00', '08.05.2025', '23:04:07'),
(2780, 'Температура охолодження вина', '14.01', '08.05.2025', '23:04:12'),
(2781, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:18'),
(2782, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:23'),
(2783, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:29'),
(2784, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:35'),
(2785, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:41'),
(2786, 'Температура охолодження вина', '14.02', '08.05.2025', '23:04:46'),
(2787, 'Температура охолодження вина', '14.01', '08.05.2025', '23:04:52'),
(2788, 'Температура охолодження вина', '14.01', '08.05.2025', '23:04:57'),
(2789, 'Температура охолодження вина', '14.01', '08.05.2025', '23:05:02'),
(2790, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:06'),
(2791, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:11'),
(2792, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:16'),
(2793, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:21'),
(2794, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:26'),
(2795, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:32'),
(2796, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:37'),
(2797, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:43'),
(2798, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:49'),
(2799, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:54'),
(2800, 'Температура охолодження вина', '14.00', '08.05.2025', '23:05:59'),
(2801, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:03'),
(2802, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:08'),
(2803, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:12'),
(2804, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:17'),
(2805, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:22'),
(2806, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:27'),
(2807, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:32'),
(2808, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:38'),
(2809, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:44'),
(2810, 'Температура охолодження вина', '14.00', '08.05.2025', '23:06:50'),
(2732, 'Температура охолодження вина', '24.00', '08.05.2025', '22:59:19'),
(2733, 'Температура охолодження вина', '24.00', '08.05.2025', '23:00:12'),
(2734, 'Температура охолодження вина', '23.59', '08.05.2025', '23:00:17'),
(2735, 'Температура охолодження вина', '22.64', '08.05.2025', '23:00:21'),
(2736, 'Температура охолодження вина', '21.35', '08.05.2025', '23:00:26'),
(2737, 'Температура охолодження вина', '19.83', '08.05.2025', '23:00:31'),
(2738, 'Температура охолодження вина', '18.29', '08.05.2025', '23:00:37'),
(2739, 'Температура охолодження вина', '16.81', '08.05.2025', '23:00:42'),
(2740, 'Температура охолодження вина', '15.44', '08.05.2025', '23:00:48'),
(2741, 'Температура охолодження вина', '14.30', '08.05.2025', '23:00:53'),
(2742, 'Температура охолодження вина', '13.39', '08.05.2025', '23:00:58'),
(2743, 'Температура охолодження вина', '12.73', '08.05.2025', '23:01:03'),
(2744, 'Температура охолодження вина', '12.28', '08.05.2025', '23:01:08'),
(2745, 'Температура охолодження вина', '12.06', '08.05.2025', '23:01:14'),
(2746, 'Температура охолодження вина', '12.03', '08.05.2025', '23:01:19'),
(2747, 'Температура охолодження вина', '12.13', '08.05.2025', '23:01:24'),
(2748, 'Температура охолодження вина', '12.34', '08.05.2025', '23:01:28'),
(2749, 'Температура охолодження вина', '12.62', '08.05.2025', '23:01:33'),
(2750, 'Температура охолодження вина', '12.94', '08.05.2025', '23:01:38'),
(2751, 'Температура охолодження вина', '13.26', '08.05.2025', '23:01:42'),
(2752, 'Температура охолодження вина', '13.56', '08.05.2025', '23:01:48'),
(2753, 'Температура охолодження вина', '13.84', '08.05.2025', '23:01:53'),
(2754, 'Температура охолодження вина', '14.06', '08.05.2025', '23:01:59'),
(2755, 'Температура охолодження вина', '14.23', '08.05.2025', '23:02:05'),
(2756, 'Температура охолодження вина', '14.35', '08.05.2025', '23:02:11'),
(2757, 'Температура охолодження вина', '14.42', '08.05.2025', '23:02:16'),
(2758, 'Температура охолодження вина', '14.45', '08.05.2025', '23:02:21'),
(2759, 'Температура охолодження вина', '14.44', '08.05.2025', '23:02:26'),
(2760, 'Температура охолодження вина', '14.40', '08.05.2025', '23:02:30'),
(2761, 'Температура охолодження вина', '14.35', '08.05.2025', '23:02:34'),
(2762, 'Температура охолодження вина', '14.28', '08.05.2025', '23:02:39'),
(2763, 'Температура охолодження вина', '14.21', '08.05.2025', '23:02:44'),
(2764, 'Температура охолодження вина', '14.14', '08.05.2025', '23:02:49'),
(2765, 'Температура охолодження вина', '14.07', '08.05.2025', '23:02:55'),
(2766, 'Температура охолодження вина', '14.02', '08.05.2025', '23:03:00'),
(2767, 'Температура охолодження вина', '13.97', '08.05.2025', '23:03:06'),
(2768, 'Температура охолодження вина', '13.94', '08.05.2025', '23:03:13'),
(2769, 'Температура охолодження вина', '13.92', '08.05.2025', '23:03:19'),
(2770, 'Температура охолодження вина', '13.91', '08.05.2025', '23:03:25'),
(2771, 'Температура охолодження вина', '13.90', '08.05.2025', '23:03:30'),
(2772, 'Температура охолодження вина', '13.91', '08.05.2025', '23:03:35'),
(2773, 'Температура охолодження вина', '13.92', '08.05.2025', '23:03:40'),
(2774, 'Температура охолодження вина', '13.93', '08.05.2025', '23:03:45'),
(2775, 'Температура охолодження вина', '13.95', '08.05.2025', '23:03:50'),
(2776, 'Температура охолодження вина', '13.96', '08.05.2025', '23:03:54'),
(2777, 'Температура охолодження вина', '13.98', '08.05.2025', '23:03:58'),
(2778, 'Температура охолодження вина', '13.99', '08.05.2025', '23:04:03');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `data`
--
ALTER TABLE `data`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `data`
--
ALTER TABLE `data`
  MODIFY `ID` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2811;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
